docs/syntax_spec.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-28 Sat 22:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Syntax Specification</title>
<meta name="author" content="rem" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Syntax Specification</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6d2c52f">1. Readers Note</a></li>
<li><a href="#org5fc527b">2. Types</a></li>
<li><a href="#org63228c2">3. Precedence Table</a></li>
<li><a href="#orgc36cec6">4. Syntax</a>
<ul>
<li><a href="#orgd55f8df">4.1. Comments</a></li>
<li><a href="#org9b9e6fc">4.2. Import</a></li>
<li><a href="#org3e331f1">4.3. Expressions</a></li>
<li><a href="#org3534817">4.4. Statements</a>
<ul>
<li><a href="#org80630e4">4.4.1. If statement</a></li>
<li><a href="#org57d51e5">4.4.2. For and while loops</a></li>
<li><a href="#orgaea54c5">4.4.3. Pattern matching</a></li>
<li><a href="#orgecefc9e">4.4.4. Structs and enums</a></li>
</ul>
</li>
<li><a href="#orgb891335">4.5. Modules</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6d2c52f" class="outline-2">
<h2 id="org6d2c52f"><span class="section-number-2">1.</span> Readers Note</h2>
<div class="outline-text-2" id="text-1">
<p>
The specification for the entire language is in flux, and subject to change without warning.
Additionally, the specification is written in <a href="https://orgmode.org">Org</a> mode so use Emacs if you intend to edit it.
</p>
</div>
</div>
<div id="outline-container-org5fc527b" class="outline-2">
<h2 id="org5fc527b"><span class="section-number-2">2.</span> Types</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Signed integers: <code>i8, i16, i32, i64</code></li>
<li>Unsigned integers: <code>u8, u16, u32, u64</code></li>
<li>Pointers: <code>*type</code></li>
<li>Arrays: <code>[]type</code></li>
</ul>

<p>
Generic types are represented as <i>type variables</i> in the type system, until they are
later substituted with a concrete type during a process known as <b>unification</b>.
</p>
</div>
</div>
<div id="outline-container-org63228c2" class="outline-2">
<h2 id="org63228c2"><span class="section-number-2">3.</span> Precedence Table</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operators</th>
<th scope="col" class="org-right">Precedence</th>
<th scope="col" class="org-left">Assoc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Plus, Minus</td>
<td class="org-right">10</td>
<td class="org-left">Left</td>
</tr>

<tr>
<td class="org-left">Star, Slash</td>
<td class="org-right">20</td>
<td class="org-left">Left</td>
</tr>

<tr>
<td class="org-left">DoubleEq, BangEq</td>
<td class="org-right">5</td>
<td class="org-left">Left</td>
</tr>

<tr>
<td class="org-left">Less, LessEq, Greater, GreaterEq</td>
<td class="org-right">5</td>
<td class="org-left">Left</td>
</tr>

<tr>
<td class="org-left">PlusEq, MinusEq, StarEq, SlashEq</td>
<td class="org-right">5</td>
<td class="org-left">Left</td>
</tr>

<tr>
<td class="org-left">Bang, KwAnd, KwOr</td>
<td class="org-right">2</td>
<td class="org-left">Left</td>
</tr>
</tbody>
</table>

<p>
<code>!</code>, <code>and</code> and <code>or</code> have the lowest precedence while <code>*</code> and <code>/</code> have the highest.
This means that multiplication and division will be <i>prioritized</i> in the expression parser.
</p>

<p>
Assignment is not defined as an operator, but it would be <b>right associative</b>.
</p>
</div>
</div>
<div id="outline-container-orgc36cec6" class="outline-2">
<h2 id="orgc36cec6"><span class="section-number-2">4.</span> Syntax</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd55f8df" class="outline-3">
<h3 id="orgd55f8df"><span class="section-number-3">4.1.</span> Comments</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Comments are written the same way as in Lua.
</p>
<div class="org-src-container">
<pre class="src src-lua">  -- A single line comment
  --- A documentation comment
</pre>
</div>
</div>
</div>
<div id="outline-container-org9b9e6fc" class="outline-3">
<h3 id="org9b9e6fc"><span class="section-number-3">4.2.</span> Import</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Each file is its own individual module. For example, a file located in <b>std/math</b> would be
imported as <code>import std.math</code>.
</p>

<p>
See <a href="#orgb891335">4.5</a> for more information on how the module system will work.
</p>

<div class="org-src-container">
<pre class="src src-nil">  import module.function

  ...
  module.function()
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e331f1" class="outline-3">
<h3 id="org3e331f1"><span class="section-number-3">4.3.</span> Expressions</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Literals: <code>5</code>, <code>3.14</code>, <code>"hello world"</code></li>
<li>Array literal: <code>["cheese", "milk", "eggs"]</code>, <code>[1, 2, 3]</code></li>
<li>Binary and unary expression: <code>1 + 2</code>, <code>-1</code></li>
<li>Function calls: <code>max(1, 2)</code></li>
</ul>

<p>
Some expressions can be used as statements (function calls and assignments)
Array literals cannot mix types, all elements of an array need to be the same type.
</p>
</div>
</div>
<div id="outline-container-org3534817" class="outline-3">
<h3 id="org3534817"><span class="section-number-3">4.4.</span> Statements</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org80630e4" class="outline-4">
<h4 id="org80630e4"><span class="section-number-4">4.4.1.</span> If statement</h4>
<div class="outline-text-4" id="text-4-4-1">
<div class="org-src-container">
<pre class="src src-lua">  if cond then
     block
  end

  if cond then
     then_block
  else
     else_block
  end
</pre>
</div>

<p>
Representation as EBNF
</p>
<div class="org-src-container">
<pre class="src src-bnf">  block = stmt*;

  if_cond = expr;
  if_stmt = "if" if_cond "then" block ("else" block)? "end";
</pre>
</div>
</div>
</div>
<div id="outline-container-org57d51e5" class="outline-4">
<h4 id="org57d51e5"><span class="section-number-4">4.4.2.</span> For and while loops</h4>
<div class="outline-text-4" id="text-4-4-2">
<div class="org-src-container">
<pre class="src src-lua">  for i = 0, 10 do
      block
  end

  while counter &lt; 10 do
      block
  end
</pre>
</div>

<p>
Representation as EBNF
</p>
<div class="org-src-container">
<pre class="src src-bnf">  block = stmt*;
  for_init = ident "=" expr;
  for_loop = "for" for_init "," expr "do" block "end";

  while_loop = "while" expr "do" block "end";
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaea54c5" class="outline-4">
<h4 id="orgaea54c5"><span class="section-number-4">4.4.3.</span> Pattern matching</h4>
<div class="outline-text-4" id="text-4-4-3">
<p>
Rust like pattern matching will be supported later on the language, along with exhaustivity checking
</p>

<div class="org-src-container">
<pre class="src src-nil">  match expr
     pat =&gt; expr,
     pat =&gt; expr,
     else =&gt; expr,
  end
</pre>
</div>

<p>
Representation as EBNF:
</p>
<div class="org-src-container">
<pre class="src src-bnf">  match_stmt = "match" expr cases "end";
  cases = (pattern ",")*;

  pattern = matchee "=&gt;" matcher;
  matchee =
   | expr
   | struct_ctor
   | "[" (hd &lt;- ident) "," (tl &lt;- ident) "]"
   | "else" // fallback case
  
  // Pattern format:
  // exp =&gt; expr (match on expression exp)
  // name =&gt; expr (match on name exactly)
  // { member: val } =&gt; expr (match on a anonymous struct constructor)
  // [x, xs] =&gt; expr (match on list, partition into x and xs)?
</pre>
</div>
</div>
</div>
<div id="outline-container-orgecefc9e" class="outline-4">
<h4 id="orgecefc9e"><span class="section-number-4">4.4.4.</span> Structs and enums</h4>
<div class="outline-text-4" id="text-4-4-4">
<p>
Structs are the primary way of storing and encapsulating state. Enums are similar to C
enums in function, but their fields are namespaced to the enum.
</p>

<div class="org-src-container">
<pre class="src src-nil">  struct Employee
     name: string,
     pay: i32
  end

  enum Color
     red,
     green,
     blue
  end
</pre>
</div>

<p>
Representation as EBNF
</p>
<div class="org-src-container">
<pre class="src src-bnf">  struct_member = ident ":" type;
  struct_members = (struct_member ",")*
  struct_decl = "struct" ident struct_members "end";

  enum_field = ident;
  enum_fields = (enum_field ",")*;
  enum_decl = "enum" ident enum_fields "end";
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb891335" class="outline-3">
<h3 id="orgb891335"><span class="section-number-3">4.5.</span> Modules</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Modules are a way to store related units of code. Each file is tied to a single module named after itself.
</p>

<p>
Modules are heavily in development.
</p>

<p>
Compiler pipeline (this is related to modules, be <i>patient</i>)
</p>
<ol class="org-ol">
<li>Lexing and parsing
<ul class="org-ul">
<li>During lexical analysis we scan and parse the file into an AST</li>
</ul></li>

<li>Name resolution
<ul class="org-ul">
<li>The next step is to perform name resolution on the AST, this happens as part of typechecking</li>
<li><i>Here</i> is where this becomes relevant, when we see an <code>import</code> we need to read the file that
we are imported and parse it into an <i>AST</i> for resolving imports.</li>
</ul></li>

<li>Type checking
<ul class="org-ul">
<li>This step is just turning our un-typed program into a full-typed program. Also elaboration
(combined inference and unification) for generics happens here.</li>
</ul></li>
</ol>


<div class="org-src-container">
<pre class="src src-bnf">  top_level_stmt =
      function_decl
    | struct_decl
    | enum_decl
    ;

  // Each file contains a list of top level statements
  // A module maps to a file
  file_root = top_level_stmt*;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #87ceeb; font-weight: bold;">#</span><span style="color: #21bfc2; font-weight: bold;">[</span><span style="color: #87ceeb; font-weight: bold;">derive</span><span style="color: #6c6f93; font-weight: bold;">(</span><span style="color: #87ceeb; font-weight: bold;">Debug, Clone</span><span style="color: #6c6f93; font-weight: bold;">)</span><span style="color: #21bfc2; font-weight: bold;">]</span>
<span style="color: #b877db;">pub</span> <span style="color: #b877db;">struct</span> <span style="color: #87ceeb;">ModuleInfo</span> <span style="color: #21bfc2;">{</span>
    <span style="color: #b877db;">pub</span> <span style="color: #e95678;">filename</span>: <span style="color: #87ceeb;">String</span>,
    <span style="color: #b877db;">pub</span> <span style="color: #e95678;">module_name</span>: <span style="color: #87ceeb;">String</span>,

    <span style="color: #b877db;">pub</span> <span style="color: #e95678;">child_modules</span>: <span style="color: #87ceeb;">Vec</span><span style="color: #6c6f93;">&lt;</span><span style="color: #87ceeb;">ModuleInfo</span><span style="color: #6c6f93;">&gt;</span>,
    <span style="color: #b877db;">pub</span> <span style="color: #e95678;">functions</span>: <span style="color: #87ceeb;">Vec</span><span style="color: #6c6f93;">&lt;</span><span style="color: #87ceeb;">FunctionInfo</span><span style="color: #6c6f93;">&gt;</span>,
    <span style="color: #b877db;">pub</span> <span style="color: #e95678;">structures</span>: <span style="color: #87ceeb;">Vec</span><span style="color: #6c6f93;">&lt;</span><span style="color: #87ceeb;">StructureInfo</span><span style="color: #6c6f93;">&gt;</span>,
<span style="color: #21bfc2;">}</span>

<span style="color: #87ceeb; font-weight: bold;">#</span><span style="color: #21bfc2; font-weight: bold;">[</span><span style="color: #87ceeb; font-weight: bold;">derive</span><span style="color: #6c6f93; font-weight: bold;">(</span><span style="color: #87ceeb; font-weight: bold;">Debug, Clone</span><span style="color: #6c6f93; font-weight: bold;">)</span><span style="color: #21bfc2; font-weight: bold;">]</span>
<span style="color: #b877db;">pub</span> <span style="color: #b877db;">struct</span> <span style="color: #87ceeb;">ModuleResolver</span> <span style="color: #21bfc2;">{</span>
    <span style="color: #4e5059; font-style: italic;">// </span><span style="color: #4e5059; font-style: italic;">Keep track of the current module information. We will update this</span>
    <span style="color: #4e5059; font-style: italic;">// </span><span style="color: #4e5059; font-style: italic;">as we resolve the module later on</span>
    <span style="color: #e95678;">info</span>: <span style="color: #87ceeb;">ModuleInfo</span>,
<span style="color: #21bfc2;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-09-14</p>
<p class="author">Author: rem</p>
<p class="date">Created: 2024-09-28 Sat 22:44</p>
</div>
</body>
</html>
